import React, { useState } from 'react';
import Modal from '../../Modal';

const policies = [
    {
        id: 1,
        title: "المعلومات الشخصية",
        content: `انه يحتاج الى ابتسامة كبيرة. موريس يتملق النخبة، يحتاج إلى الصبغة
        الجميع يريد أن باستثناء السعر باعتباره لاسينيا في عنصر ذلك. إنها كتلة حكيمة، الوادي ليس حتى من الصغار، هو ضروري فقط. غدًا قيل 
        أن البوابة صغيرة ولكنها كبيرة.  ليس أفضل وقت للاعبين الذين قرأوا الكتاب. يعد المبنى والساحة
         أكثر أهمية من عنصر السيارة ولكنه مهم للمالك. حتى ذلك الحين، أحتاج إلى القيام بواجباتي المنزلية. حتى ذلك الحين، أحتاج إلى القيام بواجباتي المنزلية. يدخل الأطفال من باب العيادة. إن الفصل الدراسي هو أكثر من ذلك، فهو عنصر من ذلك. إنها كتلة حكيمة، الوادي ليس مليئا بالناس`
    },
    {
        id: 2,
        title: "جمع المعلومات الشخصية",
        content: `انه يحتاج الى ابتسامة كبيرة. موريس يتملق النخبة، يحتاج إلى الصبغة nibh pulvinar a.
         الجميع يريد أن باستثناء السعر باعتباره لاسينيا في عنصر ذلك. 
         إنها كتلة حكيمة، الوادي ليس حتى من الصغار، هو ضروري فقط. غدًا قيل أن البوابة صغيرة ولكنها كبيرة. Curabitur ليس أفضل وقت للاعبين الذين قرأوا الكتاب. يعد المبنى والساحة أكثر أهمية من عنصر
         السيارة ولكنه مهم للمالك. حتى ذلك الحين، أحتاج إلى القيام بواجباتي المنزلية. حتى ذلك الحين، أحتاج إلى القيام بواجباتي المنزلية. يدخل الأطفال من باب `
    },
    {
        id: 3,
        title: "استخدام معلوماتك الشخصية والكشف عنها"
        , content: `انه يحتاج الى ابتسامة كبيرة. موريس يتملق النخبة، يحتاج إلى الصبغة 
        nibh pulvinar a. الجميع يريد أن باستثناء السعر باعتباره لاسينيا في عنصر ذلك. إنها كتلة حكيمة، 
        الوادي ليس حتى من الصغار، هو ضروري فقط. غدًا قيل أن البوابة صغيرة ولكنها كبيرة. Curabitur ليس أفضل وقت للاعبين الذين قرأوا الكتاب. يعد المبنى والساحة أكثر
         أهمية من عنصر السيارة ولكنه مهم للمالك. حتى ذلك الحين، أحتاج إلى القيام بواجباتي المنزلية. حتى ذلك الحين، أحتاج إلى القيام بواجباتي المنزلية. يدخل الأطفال من باب `
    }
    // ... Add more sections as needed
];

const TermsAndConditions = ({ isOpen, onClose, projectData, onSave, height, handleBtn }) => {





    const handleSubmit = (e) => {
        e.preventDefault();
    };

    if (!isOpen) return null;

    return (
        <Modal onClose={onClose} height={'100%'} width={'auto'}>
            {/* <h2 className='header-text-edit-project'>Fill Complaint
            </h2>
            <img src={lineUnder} alt='' /> */}
            {/* <div className="edit-project-form">
                <h2 className='header-TermsAndConditions'>الشروط والأحكام</h2>
            </div> */}
            <div className="policies-container-s">
                <h1 >الشروط والأحكام</h1>
                {policies.map(policy => (
                    <div key={policy.id} className="policy-section">
                        <h2>{policy.id}. {policy.title}:</h2>
                        <p>{policy.content}</p>
                    </div>
                ))}
            </div>
        </Modal>
    );
};

export default TermsAndConditions;
